name: "affineRegressionNet"
layers {
    name: "data"
    type: HDF5_DATA
    top: "data"
    top: "label"
    hdf5_data_param {
        source: "/media/philo/1T_HardDisk/cnn_shift_data/train.txt"
        batch_size: 20
    }
    include: { phase: TRAIN }
}
layers {
    name: "data"
    type: HDF5_DATA
    top: "data"
    top: "label"
    hdf5_data_param {
        source: "/media/philo/1T_HardDisk/cnn_shift_data/test.txt"
        batch_size: 20
    }
    include: { phase: TEST }
}
layers {
    name: "slice_pair"
    type: SLICE
    bottom: "data"
    top: "data1"
    top: "data2"
    slice_param {
        slice_dim: 1
        slice_point: 3
    }
}
layers {
	name: "conv1"
	type: CONVOLUTION
	bottom: "data1"
	top: "conv1"
	blobs_lr: 1
	blobs_lr: 2
	convolution_param {
		num_output: 64
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param: "conv1_w"
	param: "conv1_b"
}
layers {
	name: "relu1"
	type: RELU
	bottom: "conv1"
	top: "conv1"
}

layers {
	name: "conv2"
	type: CONVOLUTION
	bottom: "conv1"
	top: "conv2"
	blobs_lr: 1
	blobs_lr: 2
	convolution_param {
		num_output: 128
		kernel_size: 3
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
		stride: 1
	}
	param: "conv2_w"
	param: "conv2_b"
}
layers {
	name: "relu2"
	type: RELU
	bottom: "conv2"
	top: "conv2"
}

layers {
	name: "conv3"
	type: CONVOLUTION
	bottom: "conv2"
	top: "conv3"
	blobs_lr: 1
	blobs_lr: 2
	convolution_param {
		num_output: 256
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param: "conv3_w"
	param: "conv3_b"
}
layers {
	name: "relu3"
	type: RELU
	bottom: "conv3"
	top: "conv3"
}

layers {
	name: "conv1_p"
	type: CONVOLUTION
	bottom: "data2"
	top: "conv1_p"
	blobs_lr: 1
	blobs_lr: 2
	convolution_param {
		num_output: 64
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param: "conv1_w"
	param: "conv1_b"
}
layers {
	name: "relu1_p"
	type: RELU
	bottom: "conv1_p"
	top: "conv1_p"
}

layers {
	name: "conv2_p"
	type: CONVOLUTION
	bottom: "conv1_p"
	top: "conv2_p"
	blobs_lr: 1
	blobs_lr: 2
	convolution_param {
		num_output: 128
		kernel_size: 3
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
		stride: 1
	}
	param: "conv2_w"
	param: "conv2_b"
}
layers {
	name: "relu2_p"
	type: RELU
	bottom: "conv2_p"
	top: "conv2_p"
}

layers {
	name: "conv3_p"
	type: CONVOLUTION
	bottom: "conv2_p"
	top: "conv3_p"
	blobs_lr: 1
	blobs_lr: 2
	convolution_param {
		num_output: 256
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
		}
	}
	param: "conv3_w"
	param: "conv3_b"
}
layers {
	name: "relu3_p"
	type: RELU
	bottom: "conv3_p"
	top: "conv3_p"
}


layers {
	name: "concat"
	bottom: "conv3"
	bottom: "conv3_p"
	top: "concat"
	type: CONCAT
	concat_param {
		concat_dim: 1
	}
}


layers {
    name: "fc1"
    type: INNER_PRODUCT
    bottom: "concat"
    top: "fc1"
    inner_product_param {
        num_output: 2
	    weight_filler {
		    type: "xavier"
	    }
    }
}
layers {
  name: "loss"
  type: EUCLIDEAN_LOSS
  bottom: "fc1"
  bottom: "label"
  top: "loss"
}
