name: "affineRegressionNet"
layers {
    name: "data"
    type: HDF5_DATA
    top: "data"
    top: "label"
    hdf5_data_param {
        source: "/media/philo/1T_HardDisk/cnn_affine_data/finetune/train.txt"
        batch_size: 100
    }
    include: { phase: TRAIN }
}
layers {
    name: "data"
    type: HDF5_DATA
    top: "data"
    top: "label"
    hdf5_data_param {
        source: "/media/philo/1T_HardDisk/cnn_affine_data/test.txt"
        batch_size: 100
    }
    include: { phase: TEST }
}
layers {
    name: "slice_pair"
    type: SLICE
    bottom: "data"
    top: "data1"
    top: "data2"
    slice_param {
        slice_dim: 1
        slice_point: 3
    }
}
layers {
	name: "conv1"
	type: CONVOLUTION
	bottom: "data1"
	top: "conv1"
    blobs_lr: 1
    blobs_lr: 2
    weight_decay: 1
    weight_decay: 0
	convolution_param {
		num_output: 96
		kernel_size: 7
		stride: 2
		weight_filler {
			type: "xavier"
		}
	}
	param: "conv1_w"
	param: "conv1_b"
}
layers {
	name: "relu1"
	type: RELU
	bottom: "conv1"
	top: "conv1"
}
layers {
	name: "conv2"
	type: CONVOLUTION
	bottom: "conv1"
	top: "conv2"
    blobs_lr: 1
    blobs_lr: 2
    weight_decay: 1
    weight_decay: 0
	convolution_param {
		num_output: 256
		kernel_size: 5
        stride: 2
		weight_filler {
			type: "xavier"
		}
	}
	param: "conv2_w"
	param: "conv2_b"
}
layers {
	name: "relu2"
	type: RELU
	bottom: "conv2"
	top: "conv2"
}
layers {
	name: "conv3"
	type: CONVOLUTION
	bottom: "conv2"
	top: "conv3"
    blobs_lr: 1
    blobs_lr: 2
    weight_decay: 1
    weight_decay: 0
	convolution_param {
		num_output: 384
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
	}
	param: "conv3_w"
	param: "conv3_b"
}
layers {
	name: "relu3"
	type: RELU
	bottom: "conv3"
	top: "conv3"
}
layers {
    name: "conv4"
    type: CONVOLUTION
    bottom: "conv3"
    top: "conv4"
    blobs_lr: 1
    blobs_lr: 2
    weight_decay: 1
    weight_decay: 0
    convolution_param {
        num_output: 256
        kernel_size: 3
        stride: 1
        weight_filler {
            type: "xavier"
        }
    }
    param: "conv4_w"
    param: "conv4_b"
}
layers {
    name: "relu4"
    type: RELU
    bottom: "conv4"
    top: "conv4"
}

layers {
	name: "conv1_p"
	type: CONVOLUTION
	bottom: "data2"
	top: "conv1_p"
    blobs_lr: 1
    blobs_lr: 2
    weight_decay: 1
    weight_decay: 0
	convolution_param {
		num_output: 96
		kernel_size: 7
		stride: 2
		weight_filler {
			type: "xavier"
		}
	}
	param: "conv1_w"
	param: "conv1_b"
}
layers {
	name: "relu1_p"
	type: RELU
	bottom: "conv1_p"
	top: "conv1_p"
}
layers {
	name: "conv2_p"
	type: CONVOLUTION
	bottom: "conv1_p"
	top: "conv2_p"
    blobs_lr: 1
    blobs_lr: 2
    weight_decay: 1
    weight_decay: 0
	convolution_param {
		num_output: 256
		kernel_size: 5
        stride: 2
		weight_filler {
			type: "xavier"
		}
	}
	param: "conv2_w"
	param: "conv2_b"
}
layers {
	name: "relu2_p"
	type: RELU
	bottom: "conv2_p"
	top: "conv2_p"
}
layers {
	name: "conv3_p"
	type: CONVOLUTION
	bottom: "conv2_p"
	top: "conv3_p"
    blobs_lr: 1
    blobs_lr: 2
    weight_decay: 1
    weight_decay: 0
	convolution_param {
		num_output: 384
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
	}
	param: "conv3_w"
	param: "conv3_b"
}
layers {
	name: "relu3_p"
	type: RELU
	bottom: "conv3_p"
	top: "conv3_p"
}

layers {
    name: "conv4_p"
    type: CONVOLUTION
    bottom: "conv3_p"
    top: "conv4_p"
    blobs_lr: 1
    blobs_lr: 2
    weight_decay: 1
    weight_decay: 0
    convolution_param {
        num_output: 256
        kernel_size: 3
        stride: 1
        weight_filler {
            type: "xavier"
        }
    }
    param: "conv4_w"
    param: "conv4_b"
}
layers {
    name: "relu4_p"
    type: RELU
    bottom: "conv4_p"
    top: "conv4_p"
}

layers {
	name: "concat"
	bottom: "conv4"
	bottom: "conv4_p"
	top: "concat"
	type: CONCAT
	concat_param {
		concat_dim: 1
	}
}
layers {
    name: "fc5"
    type: INNER_PRODUCT
    bottom: "concat"
    top: "fc5"
    inner_product_param {
        num_output: 128
	    weight_filler {
		    type: "xavier"
	    }
    }
}

layers {
    name: "relu5"
    type: RELU
    bottom: "fc5"
    top: "fc5"
}
layers {
    name: "fc6"
    type: INNER_PRODUCT
    bottom: "fc5"
    top: "fc6"
    inner_product_param {
        num_output: 32
        weight_filler {
            type: "xavier"
        }
    }
}

layers {
    name: "relu6"
    type: RELU
    bottom: "fc6"
    top: "fc6"
}

layers {
    name: "fc7"
    type: INNER_PRODUCT
    bottom: "fc6"
    top: "fc7"
    inner_product_param {
        num_output: 8
        weight_filler {
            type: "xavier"
        }
    }
}

layers {
    name: "loss"
    type: EUCLIDEAN_LOSS
    bottom: "fc7"
    bottom: "label"
    top: "loss"
}
